app/controllers/blog_controller.rb

SELECT * FROM "posts" ORDER BY Date LIMIT 3
---
  def index
	@posts = Post.all(:limit =>3, :order =>"Date" )