app/controllers/candidates_controller.rb

def get_ajax
    @candidate = Candidate.find_by_ward(params[:id])
---
SELECT * FROM "candidates" WHERE ("candidates"."ward" IS NULL) LIMIT 1

def index
    @candidates = Candidate.all
---
SELECT * FROM "candidates"

  def show
    @candidate = Candidate.find(params[:id])
---
SELECT * FROM "candidates" WHERE ("candidates"."id" = 1)

  def edit
    @candidate = Candidate.find(params[:id])
---
SELECT * FROM "candidates" WHERE ("candidates"."id" = 9)

  def create
    @candidate = Candidate.new(params[:candidate])

    respond_to do |format|
      if @candidate.save
---
INSERT INTO "candidates" ("name", "created_at", "youtube", "updated_at", "website", "rss", "phone", "facebook", "office", "ward", "twitter", "email") VALUES('Mark Taylor', '2010-10-31 03:35:05', 'http://www.youtube.com/user/GoTaylorOttawa', '2010-10-31 03:35:05', 'http://www.gotaylor.ca/', '', '613-722-7373', 'http://www.facebook.com/GoTaylor.ca', '', '7', 'http://twitter.com/Go_Taylor', 'Info@GoTaylor.ca ')

  def update
    @candidate = Candidate.find(params[:id])

    respond_to do |format|
      if @candidate.update_attributes(params[:candidate])
---
SELECT * FROM "candidates" WHERE ("candidates"."id" = 9)
UPDATE "candidates" SET "image" = '/images/councilors/marianne_wilkinson.png', "updated_at" = '2010-11-08 02:05:57', "name" = 'Marianne Wilkinson' WHERE "id" = 5

  def destroy
    @candidate = Candidate.find(params[:id])
    @candidate.destroy
---
SELECT * FROM "candidates" WHERE ("candidates"."id" = 980190962)
DELETE FROM "candidates" WHERE "id" = 980190962