app/controllers/newsarticles_controller.rb

  def index
    @newsarticles = Newsarticle.all
---
SELECT * FROM "newsarticles" ORDER BY pubdate DESC

  def show
    @newsarticle = Newsarticle.find(params[:id])
---
SELECT * FROM "newsarticles" WHERE ("newsarticles"."id" = 980190962)

  def edit
    @newsarticle = Newsarticle.find(params[:id])
---
SELECT * FROM "newsarticles" WHERE ("newsarticles"."id" = 980190962)

  def create
    @newsarticle = Newsarticle.new(params[:newsarticle])

    respond_to do |format|
      if @newsarticle.save
---
INSERT INTO "newsarticles" ("pubdate", "rejection", "created_at", "title", "gnews_url", "updated_at", "url", "moderation", "source") VALUES(NULL, NULL, '2010-11-12 02:15:36', NULL, NULL, '2010-11-12 02:15:36', NULL, NULL, NULL)

  def update
    @newsarticle = Newsarticle.find(params[:id])
---
SELECT * FROM "newsarticles" WHERE ("newsarticles"."id" = 980190962)

  def destroy
    @newsarticle = Newsarticle.find(params[:id])
    @newsarticle.destroy
---
SELECT * FROM "newsarticles" WHERE ("newsarticles"."id" = 980190962)
DELETE FROM "newsarticles" WHERE "id" = 980190962