app/controllers/pages_controller.rb

SELECT * FROM "pages"
---
  def index
    @pages = Page.all

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
---
  def show
    @page = Page.find(params[:id])

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
---
  def edit
    @page = Page.find(params[:id])

INSERT INTO "pages" ("name", "head", "created_at", "title", "body", "updated_at") VALUES('Councilors', '', '2010-10-31 14:13:16', 'Ottawa City Councilors', 'Councilor info ', '2010-10-31 14:13:16')
---
  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
UPDATE "pages" SET "updated_at" = '2010-10-30 02:39:56', "head" = '<script src="http://maps.google.com/maps?file=api&amp;v=2&amp;sensor=false&amp;key=ABQIAAAAwX88IE_7YWYx0xBsFNVjORS9_fcSds54oXhJf39GLPAEyrXt1xTl_GqkQ_ANVG4noJxxGSY7ZrQYKw" type="text/javascript"></script>
---
  def update
    @page = Page.find(params[:id])

    respond_to do |format|
      if @page.update_attributes(params[:page])

SELECT * FROM "pages" WHERE ("pages"."id" = 980190962)
DELETE FROM "pages" WHERE "id" = 980190962
---
  def destroy
    @page = Page.find(params[:id])
    @page.destroy