app/controllers/viewer_controller.rb

def index
	@page = Page.find_by_name("home")
	@posts = Post.all(:order => "date", :limit => 3)
---
SELECT * FROM "pages" WHERE ("pages"."name" = 'Home') LIMIT 1
SELECT * FROM "posts" ORDER BY date DESC LIMIT 3

def show
	@page = Page.find_by_name(params[:name])

	if params[:name] == "home" then
	@posts = Post.all(:order => "date", :limit => 3)
	end

	if params[:name] == "councilors" then
	@candidates = Candidate.all(:order => "RANDOM()")
---
SELECT * FROM "pages" WHERE ("pages"."name" = 'Home') LIMIT 1
SELECT * FROM "posts" ORDER BY date ASC LIMIT 3
SELECT * FROM "candidates" ORDER BY RANDOM()