app/controllers/wards_controller.rb

  def index
    @wards = Ward.all
---
SELECT * FROM "wards"

  def show
    @ward = Ward.find(params[:id])
---
SELECT * FROM "wards" WHERE ("wards"."id" = 1)

  def edit
    @ward = Ward.find(params[:id])
---
SELECT * FROM "wards" WHERE ("wards"."id" = 1)

  def create
    @ward = Ward.new(params[:ward])

    respond_to do |format|
      if @ward.save
---
INSERT INTO "wards" ("name", "number", "created_at", "updated_at") VALUES('1', 'FUCK', '2010-11-07 03:49:25', '2010-11-07 03:49:25')

  def update
    @ward = Ward.find(params[:id])

    respond_to do |format|
      if @ward.update_attributes(params[:ward])
---
SELECT * FROM "wards" WHERE ("wards"."id" = 1)
UPDATE "wards" SET "updated_at" = '2010-11-07 03:50:43', "number" = '1', "name" = 'FUCK' WHERE "id" = 1

  def destroy
    @ward = Ward.find(params[:id])
    @ward.destroy
---
SELECT * FROM "wards" WHERE ("wards"."id" = 980190962)
DELETE FROM "wards" WHERE "id" = 980190962